## Plan for scanners/axe-core
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.scanners-axe-core will be created
  + resource "aws_iam_policy" "scanners-axe-core" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "scan-websites-scanners-axe-core"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/scanners/axe-core"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:Put*",
                          + "s3:ListBucketVersions",
                          + "s3:ListBucket",
                          + "s3:GetBucketLocation",
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.scanners-axe-core will be created
  + resource "aws_iam_role" "scanners-axe-core" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-websites-scanners-axe-core"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda_insights will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "scan-websites-scanners-axe-core"
    }

  # aws_iam_role_policy_attachment.scanners-axe-core will be created
  + resource "aws_iam_role_policy_attachment" "scanners-axe-core" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-websites-scanners-axe-core"
    }

  # aws_lambda_function.scanners-axe-core will be created
  + resource "aws_lambda_function" "scanners-axe-core" {
      + arn                            = (known after apply)
      + function_name                  = "scanners-axe-core"
      + id                             = (known after apply)
      + image_uri                      = "507252742351.dkr.ecr.ca-central-1.amazonaws.com/scan-websites/scanners/axe-core:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1600
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REPORT_DATA_BUCKET" = "scan-websites-production-axe-core-report-data"
              + "SCREENSHOT_BUCKET"  = "scan-websites-production-axe-core-screenshots"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.scanners-axe-core-lambda-permission will be created
  + resource "aws_lambda_permission" "scanners-axe-core-lambda-permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "scanners-axe-core"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:ca-central-1:507252742351:axe-core-urls"
      + statement_id  = (known after apply)
    }

  # aws_sns_topic_subscription.scanners-axe-core-lambda-subscription will be created
  + resource "aws_sns_topic_subscription" "scanners-axe-core-lambda-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:507252742351:axe-core-urls"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>